In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4], 'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [6]:
df.memory_usage()

Index    128
col1      32
col2      32
col3      32
dtype: int64

## Valores Unicos

In [8]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [9]:
# issu daki é amsm coisa q o len()
df["col2"].nunique()

3

In [10]:
df["col2"].value_countsunts()

444    2
555    1
666    1
Name: col2, dtype: int64

## Aplicar Funções

In [11]:
def cubo(x):
    return x ** 3

In [13]:
df["col1"].apply(cubo)

0     1
1     8
2    27
3    64
Name: col1, dtype: int64

In [15]:
df["col1"].apply(lambda x: x ** 3)

0     1
1     8
2    27
3    64
Name: col1, dtype: int64

In [14]:
df["concat_col1"] = df["col1"].apply(cubo)
df

   col1  col2 col3  concat_col1
0     1   444  abc            1
1     2   555  def            8
2     3   666  ghi           27
3     4   444  xyz           64

## Operações Numericas

In [16]:
df.sum()

col1                     10
col2                   2109
col3           abcdefghixyz
concat_col1             100
dtype: object

In [20]:
df.mean()

C:\Users\arthu\AppData\Local\Temp\ipykernel_7324\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

col1             2.50
col2           527.25
concat_col1     25.00
dtype: float64

In [21]:
df.product()

C:\Users\arthu\AppData\Local\Temp\ipykernel_7324\902294140.py:1: FutureWarning: The default value of numeric_only in DataFrame.prod is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.product()

col1                    24
col2           72867379680
concat_col1          13824
dtype: int64

In [17]:
df["col1"].sum()

10

In [18]:
df["col1"].mean()

2.5

In [19]:
df["col1"].product()

24

In [22]:
df["col1"].std()

1.2909944487358056

In [23]:
df["col1"].max()

4

In [24]:
df["col1"].min()

1

In [26]:
df["col1"].idxmax()

3

In [27]:
df["col1"].idxmin()

0

In [28]:
df[df["col2"]==444]

   col1  col2 col3  concat_col1
0     1   444  abc            1
3     4   444  xyz           64

In [29]:
df[df["col2"]==444]["col1"].sum()

5

In [31]:
df.sort_values(by="col2")

   col1  col2 col3  concat_col1
0     1   444  abc            1
3     4   444  xyz           64
1     2   555  def            8
2     3   666  ghi           27

In [32]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [33]:
dict_map = {"one":1, "two":2}
df["B"].map(dict_map)

0    1
1    1
2    2
3    2
4    1
5    1
Name: B, dtype: int64

In [35]:
df["E"] = df["B"].map(dict_map)
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [37]:
df.pivot_table(index="A", columns="B", values="D")

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0